/*
 * To change this license header, choose License Headers in Project Properties.
 * To change this template file, choose Tools | Templates
 * and open the template in the editor.
 */
package sktvp20task1jevgenifilin;
//Создать проект с названием JavaHello. 
// Программа должна выводить в консоль слова “Java Hello!”.
/**
 *
 * @author jevge
 */
public class SKTVp20Task1JevgeniFilin {

    /**
     * Создать проект с названием JavaHello. 
     * Программа должна выводить в консоль слова “Java Hello!”.
     */
    public static void main(String[] args) {
        System.out.println("Java Hello!");
    }
    
}
